app/controllers/articles_controller.rb

  def index
    render json: Article.all.as_json(methods: %i[default_provider_name replenish? missing? article_providers])
---
SELECT "articles".* FROM "articles" WHERE "articles"."deleted_at" IS NULL

  def create
    article = Article.new(article_params)

    if article.save
---
INSERT INTO "articles" ("name", "code", "purchase_cost", "storage_cost", "order_cost", "stock", "estimated_demand", "inventory_model", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "demand_period_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["demand_period_count", 3], ["updated_at", "2024-06-29 00:02:29.587355"], ["id", 1]]

  def destroy
    if @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 10]]

  def find_by_code
    article = Article.find_by(code: params[:code])

    if article.present?
---
SELECT "articles".* FROM "articles" WHERE "articles"."deleted_at" IS NULL AND "articles"."code" = ? LIMIT ?  [["code", "COD1"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."deleted_at" IS NULL
SELECT 1 AS one FROM "articles" WHERE "articles"."code" = ? AND "articles"."deleted_at" IS NULL AND "articles"."id" != ? LIMIT ?  [["code", "COD3"], ["id", 3], ["LIMIT", 1]]

  def set_article
    @article = Article.find_by(id: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."deleted_at" IS NULL AND "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]