app/controllers/historical_demands_controller.rb

  def create
    historical_demand = Sale.new(historical_demand_params)

    if historical_demand.save
---
INSERT INTO "historical_demands" ("period", "unit", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["period", 12], ["unit", "falopa"], ["article_id", 1], ["created_at", "2024-06-01 17:40:36.021049"], ["updated_at", "2024-06-01 17:40:36.021049"]]