app/controllers/providers_controller.rb

  def set_provider
    @provider = Provider.find_by(id: params[:id])
---
SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]