app/controllers/purchase_orders_controller.rb

  def index
    render json: PurchaseOrder.all
---
SELECT "purchase_orders".* FROM "purchase_orders"

  def create
    purchase_order = PurchaseOrder.new(purchase_order_params)

    if purchase_order.save
---
INSERT INTO "purchase_orders" ("state", "quantity", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["state", 0], ["quantity", 190], ["article_id", 1], ["created_at", "2024-06-28 23:24:37.763170"], ["updated_at", "2024-06-28 23:24:37.763170"]]

  def update
    if @purchase_order.update(purchase_order_params)
---
UPDATE "purchase_orders" SET "state" = ?, "updated_at" = ? WHERE "purchase_orders"."id" = ?  [["state", 2], ["updated_at", "2024-06-28 23:49:24.503176"], ["id", 1]]

  def set_purchase_order
    @purchase_order = PurchaseOrder.find_by(id: params[:id])
---
SELECT "purchase_orders".* FROM "purchase_orders" WHERE "purchase_orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]