app/controllers/sales_controller.rb

INSERT INTO "sales" ("sold_at", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["sold_at", "2023-06-21 14:00:00"], ["created_at", "2024-06-25 00:38:55.775787"], ["updated_at", "2024-06-25 00:38:55.775787"]]
---
  def create
    sale = Sale.new(sale_params)

    if sale.save_and_decrease_articles_stock

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sales".* FROM "sales"
---
  def set_sale
    @sale = Sale.find_by(id: params[:id])
    return if @sale.present?