app/models/article.rb

INSERT INTO "purchase_orders" ("state", "quantity", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["state", 0], ["quantity", 45], ["article_id", 1], ["created_at", "2024-06-28 23:49:24.520271"], ["updated_at", "2024-06-28 23:49:24.520271"]]
---
  def generate_purchase_order!(provider_id: default_provider_id)
    purchase_orders.create!(quantity: optimal_lot(provider_id:), state: :pending)