app/models/purchase_order.rb

  def increase_article_stock
    article.update!(stock: article.stock + quantity)
---
UPDATE "articles" SET "stock" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["stock", 21], ["updated_at", "2024-06-28 23:49:24.510464"], ["id", 1]]