app/models/sale.rb

  def save_and_decrease_articles_stock
    transaction do
      save

      # disminuir el stock de los articulos uno por uno
      # si uno falla entonces se para la ejecucion de todo
      article_sales.each do |article_sale|
        article_sale.article.stock = article_sale.article.stock - article_sale.quantity

        if article_sale.article.valid?
          article_sale.article.save
---
INSERT INTO "article_sales" ("article_id", "sale_id", "quantity", "sold_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["article_id", 1], ["sale_id", 34], ["quantity", 5], ["sold_at", "2023-06-21 14:00:00"], ["created_at", "2024-06-25 00:38:55.778042"], ["updated_at", "2024-06-25 00:38:55.778042"]]
INSERT INTO "sales" ("sold_at", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["sold_at", "2023-06-21 14:00:00"], ["created_at", "2024-06-25 00:38:55.775787"], ["updated_at", "2024-06-25 00:38:55.775787"]]
UPDATE "articles" SET "stock" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["stock", 45], ["updated_at", "2024-06-25 00:38:55.786725"], ["id", 1]]